import React from 'react';

function privacy(props) {
    return (
        <div>
            <p>개인정보처리방침</p>
        </div>
    );
}

export default privacy;


// 개인정보처리방침
// 똑똑은 사용자의 개인정보 보호를 중요하게 생각하며, 관련 법령을 준수하여 사용자의 개인정보를 안전하게 관리합니다. 본 방침은 앱에서 수집하는 개인정보의 항목, 수집 목적, 사용 방법 및 보안 조치에 대해 설명합니다.
// 1. 수집하는 개인정보의 항목
// 회원가입 시, 사용자의 서비스 이용을 위해 다음의 개인정보를 필수로 수집합니다:
// 필수 항목: 연락처(전화번호)
// 선택 항목: 이메일 주소, 닉네임, 주소(이 항목들은 사용자가 선택적으로 제공할 수 있으며, 허위로 입력해도 서비스 이용에 문제가 없습니다.)
// 이 외의 개인정보는 수집하지 않으며, 사용자의 동의 없이 추가적인 정보를 요구하지 않습니다.
// 2. 개인정보의 수집 및 이용 목적
// 수집한 개인정보는 아래의 목적을 위해 사용됩니다:
// 연락처(전화번호): 회원의 식별 및 서비스 제공, 필요 시 고객 지원 및 공지사항 전달을 위해 사용됩니다.
// 선택 항목(이메일, 닉네임 등): 사용자 간의 소통, 서비스 내의 프로필 관리 및 개인 맞춤형 서비스 제공을 위해 사용됩니다. 선택 항목은 필수 사항이 아니며, 허위로 입력해도 서비스 이용에는 영향을 주지 않습니다.
// 3. 개인정보의 보유 및 이용 기간
// 수집된 개인정보는 회원 탈퇴 시 즉시 삭제되며, 관련 법령에 의해 보관이 요구되지 않는 한 사용되지 않습니다. 법령에 따라 일정 기간 보관이 필요한 경우 해당 기간 동안 안전하게 보관됩니다.
// 4. 제3자 제공 및 위탁
// 본 어플리케이션은 사용자의 개인정보를 외부에 제공하거나 위탁하지 않습니다. 다만, 법령에 의거해 요구되는 경우를 제외하고는 사용자의 동의 없이 제3자에게 제공하지 않습니다.
// 5. 설치 시 요구되는 권한
// 본 어플리케이션은 서비스 제공에 필요한 최소한의 권한만을 요청합니다:
// 네트워크 연결 권한: 웹사이트와의 연결을 통해 데이터를 주고받기 위한 용도로 사용됩니다.
// 6. 개인정보의 보호
// 사용자의 개인정보는 암호화된 통신 방식으로 안전하게 전송되며, 전화번호와 같은 중요한 정보는 안전하게 저장 및 관리됩니다. 외부로부터의 해킹 및 유출을 방지하기 위해 다양한 보안 조치를 적용하고 있습니다.
// 7. 개인정보처리방침의 변경
// 본 개인정보처리방침은 변경될 수 있으며, 변경 시 어플리케이션 내에서 공지사항을 통해 사용자가 확인할 수 있도록 안내합니다.
// 8. 문의
// 개인정보처리방침에 관한 문의사항은 아래 이메일로 연락해 주시기 바랍니다.
// 이메일: ds.knockknock@gmail.com








